{"keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "output_shape": null, "batch_input_shape": [null, 64, 64, 1], "output_shape_type": "raw", "name": "Normalize", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa/D:\\WorkspacePython\\CarND-Capstone\\python\\net.py\u00da\b<lambda>9\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "valid", "name": "conv1", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max1", "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch1", "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "drop1", "rate": 0.5}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "valid", "name": "conv2", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max2", "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch2", "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "drop2", "rate": 0.5}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "valid", "name": "conv3", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 620, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null, "name": "fc1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "drop4", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 184, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null, "name": "fc2"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 32, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null, "name": "fc3"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 7, "kernel_constraint": null, "activity_regularizer": null, "activation": "softmax", "use_bias": true, "bias_constraint": null, "name": "fc4"}}], "class_name": "Sequential"}